{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"trainable": true, "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "function_type": "lambda", "name": "lambda_1", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0010model_retrain.py\u00da\b<lambda>\u00c7\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "b_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "valid", "b_constraint": null, "W_constraint": null, "nb_filter": 32, "nb_col": 3, "bias": true, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_2", "b_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "valid", "b_constraint": null, "W_constraint": null, "nb_filter": 64, "nb_col": 3, "bias": true, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_3", "b_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "valid", "b_constraint": null, "W_constraint": null, "nb_filter": 128, "nb_col": 3, "bias": true, "dim_ordering": "tf", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "activation": "linear", "output_dim": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "input_dim": 21504, "activity_regularizer": null, "bias": true, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "activation": "linear", "output_dim": 64, "trainable": true, "b_constraint": null, "W_constraint": null, "input_dim": 512, "activity_regularizer": null, "bias": true, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "activation": "linear", "output_dim": 16, "trainable": true, "b_constraint": null, "W_constraint": null, "input_dim": 64, "activity_regularizer": null, "bias": true, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "activation": "linear", "output_dim": 1, "trainable": true, "b_constraint": null, "W_constraint": null, "input_dim": 16, "activity_regularizer": null, "bias": true, "b_regularizer": null}}]}