{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 64, 64, 3]}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "nb_filter": 32, "W_regularizer": null, "activation": "linear", "bias": true, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "bias": true, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "nb_filter": 128, "W_regularizer": null, "activation": "linear", "bias": true, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 6272, "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "W_regularizer": null, "activation": "linear", "bias": true, "output_dim": 128, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"input_dim": 128, "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "W_regularizer": null, "activation": "linear", "bias": true, "output_dim": 64, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"input_dim": 64, "activity_regularizer": null, "b_constraint": null, "name": "dense_3", "W_regularizer": null, "activation": "linear", "bias": true, "output_dim": 32, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"input_dim": 32, "activity_regularizer": null, "b_constraint": null, "name": "dense_4", "W_regularizer": null, "activation": "linear", "bias": true, "output_dim": 16, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"input_dim": 16, "activity_regularizer": null, "b_constraint": null, "name": "dense_5", "W_regularizer": null, "activation": "linear", "bias": true, "output_dim": 1, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}]}