{"config": [{"config": {"output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>i\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "arguments": {}}, "class_name": "Lambda"}, {"config": {"activation": "linear", "dim_ordering": "tf", "trainable": true, "bias": true, "b_regularizer": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_1", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "nb_filter": 32, "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "dim_ordering": "tf", "trainable": true, "bias": true, "b_regularizer": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "dim_ordering": "tf", "trainable": true, "bias": true, "b_regularizer": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_3", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "nb_filter": 128, "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "trainable": true, "bias": true, "b_regularizer": null, "output_dim": 512, "b_constraint": null, "name": "dense_1", "input_dim": 21504, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "trainable": true, "bias": true, "b_regularizer": null, "output_dim": 64, "b_constraint": null, "name": "dense_2", "input_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "trainable": true, "bias": true, "b_regularizer": null, "output_dim": 16, "b_constraint": null, "name": "dense_3", "input_dim": 64, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "trainable": true, "bias": true, "b_regularizer": null, "output_dim": 1, "b_constraint": null, "name": "dense_4", "input_dim": 16, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}