{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activation": "linear", "name": "convolution2d_1", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 16, "batch_input_shape": [null, 32, 64, 1], "b_constraint": null, "W_constraint": null, "bias": true, "input_dtype": "float32", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activation": "linear", "name": "convolution2d_2", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "b_constraint": null, "W_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activation": "linear", "name": "convolution2d_3", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "b_constraint": null, "W_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 128, "activation": "linear", "activity_regularizer": null, "input_dim": 72384, "name": "dense_1", "b_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 64, "activation": "linear", "activity_regularizer": null, "input_dim": 128, "name": "dense_2", "b_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 32, "activation": "linear", "activity_regularizer": null, "input_dim": 64, "name": "dense_3", "b_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 16, "activation": "linear", "activity_regularizer": null, "input_dim": 32, "name": "dense_4", "b_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "input_dim": 16, "name": "dense_5", "b_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}