{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0010model_retrain.py\u00da\b<lambda>i\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "nb_col": 3, "nb_row": 3, "nb_filter": 32}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "nb_col": 3, "nb_row": 3, "nb_filter": 64}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "nb_col": 3, "nb_row": 3, "nb_filter": 128}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 21504, "name": "dense_1", "W_constraint": null, "W_regularizer": null, "output_dim": 512, "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 512, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "output_dim": 64, "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 64, "name": "dense_3", "W_constraint": null, "W_regularizer": null, "output_dim": 16, "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 16, "name": "dense_4", "W_constraint": null, "W_regularizer": null, "output_dim": 1, "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "b_constraint": null}}]}