{"config": [{"config": {"arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-2903f34bf76a>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "trainable": true, "output_shape": null, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "activation": "linear", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "nb_filter": 32, "border_mode": "valid", "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "activation": "linear", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "activation": "linear", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "nb_filter": 128, "border_mode": "valid", "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "output_dim": 512, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "trainable": true, "input_dim": 21504}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "output_dim": 64, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "trainable": true, "input_dim": 512}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "output_dim": 16, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "trainable": true, "input_dim": 64}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "trainable": true, "input_dim": 16}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}