{"keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-63-13a79faf3869>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "function_type": "lambda", "arguments": {}, "name": "lambda_5", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 32, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_13"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_17", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_14"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_18", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 128, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_15"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_19", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "output_dim": 512, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_17", "input_dim": 6272}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_20", "p": 0.5}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "name": "leakyrelu_13", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "output_dim": 64, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_18", "input_dim": 512}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "name": "leakyrelu_14", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "output_dim": 16, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_19", "input_dim": 64}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "name": "leakyrelu_15", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "output_dim": 1, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_20", "input_dim": 16}}], "class_name": "Sequential"}