{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-2903f34bf76a>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "arguments": {}, "trainable": true, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "activation": "linear", "nb_filter": 32, "name": "convolution2d_1", "border_mode": "valid", "W_constraint": null, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "activation": "linear", "nb_filter": 64, "name": "convolution2d_2", "border_mode": "valid", "W_constraint": null, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "activation": "linear", "nb_filter": 128, "name": "convolution2d_3", "border_mode": "valid", "W_constraint": null, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_1", "W_constraint": null, "bias": true, "output_dim": 512, "input_dim": 21504, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_2", "W_constraint": null, "bias": true, "output_dim": 64, "input_dim": 512, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_3", "W_constraint": null, "bias": true, "output_dim": 16, "input_dim": 64, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_4", "W_constraint": null, "bias": true, "output_dim": 1, "input_dim": 16, "activity_regularizer": null, "W_regularizer": null}}]}