{"config": [{"config": {"nb_filter": 16, "batch_input_shape": [null, 32, 64, 3], "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "name": "convolution2d_1", "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "bias": true, "input_dtype": "float32", "trainable": true, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_filter": 24, "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_filter": 48, "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "name": "convolution2d_3", "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 128, "trainable": true, "input_dim": 72384, "W_regularizer": null, "bias": true, "name": "dense_1", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 64, "trainable": true, "input_dim": 128, "W_regularizer": null, "bias": true, "name": "dense_2", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 32, "trainable": true, "input_dim": 64, "W_regularizer": null, "bias": true, "name": "dense_3", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 16, "trainable": true, "input_dim": 32, "W_regularizer": null, "bias": true, "name": "dense_4", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 1, "trainable": true, "input_dim": 16, "W_regularizer": null, "bias": true, "name": "dense_5", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_8", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.2.1", "class_name": "Sequential"}