{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "input_dtype": "float32", "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "activation": "linear", "batch_input_shape": [null, 32, 64, 3], "b_constraint": null, "nb_filter": 16, "W_constraint": null, "W_regularizer": null, "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "nb_filter": 24, "W_constraint": null, "W_regularizer": null, "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "nb_filter": 48, "W_constraint": null, "W_regularizer": null, "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "output_dim": 128, "trainable": true, "input_dim": 72384, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "output_dim": 64, "trainable": true, "input_dim": 128, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "output_dim": 32, "trainable": true, "input_dim": 64, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "activity_regularizer": null, "output_dim": 16, "trainable": true, "input_dim": 32, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "activity_regularizer": null, "output_dim": 1, "trainable": true, "input_dim": 16, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_8", "trainable": true}}]}