{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "output_shape": null, "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0086\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "trainable": true, "activation": "linear", "nb_filter": 32, "bias": true, "W_constraint": null, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "trainable": true, "activation": "linear", "nb_filter": 64, "bias": true, "W_constraint": null, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "trainable": true, "activation": "linear", "nb_filter": 128, "bias": true, "W_constraint": null, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "activation": "linear", "bias": true, "input_dim": 6272, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 512, "W_regularizer": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_1", "alpha": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "activation": "linear", "bias": true, "input_dim": 512, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 64, "W_regularizer": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_2", "alpha": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_3", "activation": "linear", "bias": true, "input_dim": 64, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 16, "W_regularizer": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_3", "alpha": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_4", "activation": "linear", "bias": true, "input_dim": 16, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "trainable": true}}], "keras_version": "1.2.1"}