{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "input_dtype": "float32", "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 32, 64, 3], "name": "convolution2d_1", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 48, "b_constraint": null, "dim_ordering": "tf", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 72384, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 128, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 128, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 64, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 64, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 32, "name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 32, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 16, "name": "dense_4", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 16, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 1, "name": "dense_5", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "linear", "trainable": true}}], "keras_version": "1.2.1"}