{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009d\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_filter": 16, "nb_col": 3, "subsample": [2, 2], "border_mode": "valid", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "convolution2d_1", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_filter": 24, "nb_col": 3, "subsample": [2, 2], "border_mode": "valid", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "convolution2d_2", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_filter": 48, "nb_col": 3, "subsample": [2, 2], "border_mode": "valid", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "convolution2d_3", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 2352, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 128, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 128, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 64, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 64, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 32, "name": "dense_3", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 32, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 16, "name": "dense_4", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 16, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "name": "dense_5", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true}}]}