{"keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "trainable": true, "batch_input_shape": [null, 16, 32, 3], "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 16, "name": "convolution2d_1", "bias": true, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 24, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "bias": true, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 48, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "bias": true, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 128, "input_dim": 12480, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 64, "input_dim": 128, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 32, "input_dim": 64, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 16, "input_dim": 32, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": 16, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_5", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "linear", "trainable": true}}], "class_name": "Sequential"}