{"config": [{"config": {"subsample": [1, 1], "activation": "linear", "batch_input_shape": [null, 16, 32, 1], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_filter": 16, "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dtype": "float32", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [1, 1], "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_filter": 24, "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [1, 1], "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_filter": 48, "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "activation": "linear", "input_dim": 12480, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 128, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "activation": "linear", "input_dim": 128, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 64, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "activation": "linear", "input_dim": 64, "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "output_dim": 32, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "activation": "linear", "input_dim": 32, "b_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "output_dim": 16, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "activation": "linear", "input_dim": 16, "b_regularizer": null, "name": "dense_5", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_8", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}