{"config": [{"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 16, 32, 3], "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_1", "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "input_dtype": "float32", "border_mode": "valid", "nb_filter": 16, "nb_col": 3}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_2", "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "nb_filter": 24}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_3", "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "nb_filter": 48}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 12480, "init": "glorot_uniform", "bias": true, "name": "dense_1", "output_dim": 128, "b_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 128, "init": "glorot_uniform", "bias": true, "name": "dense_2", "output_dim": 64, "b_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 64, "init": "glorot_uniform", "bias": true, "name": "dense_3", "output_dim": 32, "b_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 32, "init": "glorot_uniform", "bias": true, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "W_constraint": null, "activation": "linear"}}], "keras_version": "1.2.0", "class_name": "Sequential"}